config.org
#+EXPORT_FILE_NAME: README
#+HTML_HEAD: <link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
#+HTML_HEAD: <link href="https://codepen.io/nmartin84/pen/RwPzMPe.css" rel="stylesheet" type="text/css" />

* Getting started
** New Changes
*** [2020-07-22 Wed]
1. Added new functions specifically for GTD workflow, this will require some changes to fit your needs:
   1. Configure your variable settings in [[*Setup our intial defaults for GTD][Setup our intial defaults for GTD]]
*** [2020-06-21 Sun]
1. metrics-tracker + capture-template for habit tracker (see ~/.doom.d/templates/habitstracker.org)
2. new templates for captures, breakfix, meeting-notes, diary and more... (check the ~/.doom.d/templates/.. directory)
3. added org-roam-server
*** [2020-06-02 Tue]
1. Added =org-roam=
2. Added agenda schdules faces (thanks to )
3. Search and narrow... Bound to =SPC ^=, this provides a function to pick a headline from the current buffer and narrow to it.
4. Agenda-Hook to narrow on current subtree
5. Deft mode with custom title maker (thanks to [[https://jingsi.space/post/2017/04/05/organizing-a-complex-directory-for-emacs-org-mode-and-deft/][jingsi's space]])
6. GTD Inbox Processing ... Credit to Jethro for his function. Function is bound to =jethro/org-inbox-process=
7. [[https://github.com/alphapapa/org-web-tools][Org-Web-Tools]], thanks Alphapapa for the awesome package.
** Some Requirements
These are some items that are required outside of the normal DOOM EMACS installation, before you can use this config. The idea here is to keep this minimum so as much of this is close to regular DOOM EMACS.
1. *SQLITE3 Installation*: You will need to install sqlite3, typicalled installed via your package manager as ~sudo apt install sqlite3~
2. For fonts please download [[https://input.fontbureau.com/download/][Input]] and [[http://sourceforge.net/projects/dejavu/files/dejavu/2.37/dejavu-fonts-ttf-2.37.tar.bz2][DejaVu]]
* Initial Settings
These are things that we absolutely must load before anything else
** Setting up our initial look to Emacs and Orgmode
*** Configure Function to profile monitor setup
#+BEGIN_SRC emacs-lisp
(defun zyro/calculate-profile-width ()
  "Run calcuation to determine width of display"
  (when (and (> (* (/ (float (display-pixel-height)) (float (display-pixel-width))) 10) 3.5)
            (< (* (/ (float (display-pixel-height)) (float (display-pixel-width))) 10) 4.2))
    (setq zyro/monitor-profile-width '"ultra-wide"))
  (when (and (> (* (/ (float (display-pixel-height)) (float (display-pixel-width))) 10) 1.5)
            (< (* (/ (float (display-pixel-height)) (float (display-pixel-width))) 10) 2.9))
    (setq zyro/monitor-profile-width '"super-wide")))
(zyro/calculate-profile-width)

(setq zyro/monitor-profile-size (/ (* (float (display-pixel-width)) (float (display-pixel-height))) 100))

#+END_SRC
*** We first setup our font settings
#+BEGIN_SRC emacs-lisp
(setq doom-unicode-font doom-font)
(when (> (display-pixel-height) 1200)
  (setq doom-font (font-spec :family "Input Mono" :size 18)
        doom-big-font (font-spec :family "Input Mono" :size 24)))

(when (< (display-pixel-height) 1200)
  (setq doom-font (font-spec :family "Input Mono" :size 14)
        doom-big-font (font-spec :family "Input Mono" :size 18)))
#+END_SRC
*** Prettify ORGMODE and other aspects of Emacs
#+BEGIN_SRC emacs-lisp
;(font-lock-add-keywords 'org-mode
;                        '(("^ *\\([-]\\) "
;                           (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))
;(font-lock-add-keywords 'org-mode
;                        '(("^ *\\([+]\\) "
;                           (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "▪"))))))

; "✖"
(setq org-superstar-headline-bullets-list '("●" "○"))
(setq org-ellipsis "▼")
(add-hook 'org-mode-hook #'+org-pretty-mode)
#+END_SRC
*** Configure Category Icons for ORGMODE-AGENDA
#+BEGIN_SRC emacs-lisp
;(customize-set-value
;    'org-agenda-category-icon-alist
;    `(
;      ("Breakfix" "~/.icons/repair.svg" nil nil :ascent center)
;      ("Escalation" "~/.dotfiles/icons/loop.svg" nil nil :ascent center)
;      ("Inquiry" "~/.dotfiles/icons/calendar.svg" nil nil :ascent center)
;      ("Deployment" "~/.icons/deployment.svg" nil nil :ascent center)
;      ("Project" "~/.icons/project-management.svg" nil nil :ascent center)
;      ("Improvement" "~/.icons/improvement.svg" nil nil :ascent center)
;      ("Sustaining" "~/.icons/chemistry.svg" nil nil :ascent center)))
#+END_SRC
** Configure Default Templates
#+BEGIN_SRC emacs-lisp
(after! org (setq org-capture-templates
      '(("d" "Diary" plain (file zyro/capture-file-name)
         (file "~/.doom.d/templates/diary.org"))
        ("m" "Metrics Tracker" plain (file+olp+datetree diary-file "Metrics Tracker")
         (file "~/.doom.d/templates/metrics.org") :immediate-finish t)
        ("h" "Habits Tracker" entry (file+olp+datetree diary-file "Metrics Tracker")
         (file "~/.doom.d/templates/habitstracker.org") :immediate-finish t)
        ("a" "Article" plain (file+headline (concat (doom-project-root) "articles.org") "Inbox")
         "%(call-interactively #'org-cliplink-capture)")
        ("x" "Time Tracker" entry (file+headline "~/.org/timetracking.org" "Time Tracker")
;         "* %^{TITLE} %^{CUSTOMER}p %^{TAG}p" :clock-in t :clock-resume t)))
         (file "~/.doom.d/templates/timetracker.org") :clock-in t :clock-resume t))))
#+END_SRC

** Setup Default Directory and Files
#+BEGIN_SRC emacs-lisp
(setq org-directory "~/.org/")
#+END_SRC
* GTD Setup
** TODO Setup our intial defaults for GTD
#+BEGIN_SRC emacs-lisp

;; Configure ORG Directory
(defvar org-directory "~/.org/")

;; Configure Folders
(defvar org-gtd-tasks-folder "~/.org/tasks/")
(defvar org-projects-folder "~/.org/tasks/projects/")

;; Configure files
(defvar org-someday-file (file-truename (concat org-gtd-tasks-folder "someday.org")))
(defvar org-inbox-file (file-truename (concat org-gtd-tasks-folder "inbox.org")))
(defvar org-references-file (file-truename (concat org-gtd-tasks-folder "references.org")))
(defvar org-tickler-file (file-truename (concat org-gtd-tasks-folder"tickler.org")))
(defvar org-next-tasks-file (file-truename (concat org-gtd-tasks-folder "next.org")))

#+END_SRC
** TODO Capture System
#+BEGIN_SRC emacs-lisp
(defun zyro/capture-system ()
  "Capture"
  (interactive)
  (let* ((org-capture-templates
         '(("!" "Quick Capture" plain (function zyro/capture-inbox)
            (file "~/.doom.d/templates/capture.org")))))
    (org-capture)))

(defun zyro/capture-inbox ()
  "Function to locate file for capture template"
  (expand-file-name (format "%s" (file-name-nondirectory (car org-inbox-file))) org-gtd-tasks-folder))

#+END_SRC
** TODO Configuring =someday.org=

Configure our someday file finder
#+BEGIN_SRC emacs-lisp
(defun zyro/agenda-someday ()
  "Open next tasks in ORGMODE AGENDA"
  (interactive)
  (let ((org-agenda-files (list (car org-someday-file)))
        (org-super-agenda-groups
                     '((:priority "A")
                       (:priority "B")
                       (:todo "PROJ")
                       (:effort> "0:16")
                       (:effort< "0:15"))))
    (org-agenda nil "t")))
#+END_SRC

Configure Keybindings
#+BEGIN_SRC emacs-lisp
(map! :after org
      :map org-mode-map
      :leader
      :prefix ("e" . "Getting Things Done")
      :desc "SOMEDAY" "s" #'zyro/agenda-someday
      :prefix ("eg" . "goto")
      :desc "Someday Items" "s" #'org-find-someday-file)
#+END_SRC

Configuring file-finder
#+BEGIN_SRC emacs-lisp
(defun org-find-someday-file ()
  "Find default INBOX file"
  (interactive)
  (if (f-file-p (format "%s"(car org-someday-file)))
      (find-file (car org-someday-file))
    (error (format "'%s' does not exist, please check and make sure the file exist."))))
#+END_SRC
