config.el
(defun zyro/calculate-profile-width ()
  "Run calcuation to determine width of display"
  (when (and (> (* (/ (float (display-pixel-height)) (float (display-pixel-width))) 10) 3.5)
            (< (* (/ (float (display-pixel-height)) (float (display-pixel-width))) 10) 4.2))
    (setq zyro/monitor-profile-width '"ultra-wide"))
  (when (and (> (* (/ (float (display-pixel-height)) (float (display-pixel-width))) 10) 1.5)
            (< (* (/ (float (display-pixel-height)) (float (display-pixel-width))) 10) 2.9))
    (setq zyro/monitor-profile-width '"super-wide")))
(zyro/calculate-profile-width)

(setq zyro/monitor-profile-size (/ (* (float (display-pixel-width)) (float (display-pixel-height))) 100))

(setq doom-unicode-font doom-font)
(when (> (display-pixel-height) 1200)
  (setq doom-font (font-spec :family "Input Mono" :size 18)
        doom-big-font (font-spec :family "Input Mono" :size 24)))

(when (< (display-pixel-height) 1200)
  (setq doom-font (font-spec :family "Input Mono" :size 14)
        doom-big-font (font-spec :family "Input Mono" :size 18)))

;(font-lock-add-keywords 'org-mode
;                        '(("^ *\\([-]\\) "
;                           (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))
;(font-lock-add-keywords 'org-mode
;                        '(("^ *\\([+]\\) "
;                           (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "▪"))))))

; "✖"
(setq org-superstar-headline-bullets-list '("●" "○"))
(setq org-ellipsis "▼")
(add-hook 'org-mode-hook #'+org-pretty-mode)

;(customize-set-value
;    'org-agenda-category-icon-alist
;    `(
;      ("Breakfix" "~/.icons/repair.svg" nil nil :ascent center)
;      ("Escalation" "~/.dotfiles/icons/loop.svg" nil nil :ascent center)
;      ("Inquiry" "~/.dotfiles/icons/calendar.svg" nil nil :ascent center)
;      ("Deployment" "~/.icons/deployment.svg" nil nil :ascent center)
;      ("Project" "~/.icons/project-management.svg" nil nil :ascent center)
;      ("Improvement" "~/.icons/improvement.svg" nil nil :ascent center)
;      ("Sustaining" "~/.icons/chemistry.svg" nil nil :ascent center)))

(after! org (setq org-capture-templates
      '(("d" "Diary" plain (file zyro/capture-file-name)
         (file "~/.doom.d/templates/diary.org"))
        ("m" "Metrics Tracker" plain (file+olp+datetree diary-file "Metrics Tracker")
         (file "~/.doom.d/templates/metrics.org") :immediate-finish t)
        ("h" "Habits Tracker" entry (file+olp+datetree diary-file "Metrics Tracker")
         (file "~/.doom.d/templates/habitstracker.org") :immediate-finish t)
        ("a" "Article" plain (file+headline (concat (doom-project-root) "articles.org") "Inbox")
         "%(call-interactively #'org-cliplink-capture)")
        ("x" "Time Tracker" entry (file+headline "~/.org/timetracking.org" "Time Tracker")
;         "* %^{TITLE} %^{CUSTOMER}p %^{TAG}p" :clock-in t :clock-resume t)))
         (file "~/.doom.d/templates/timetracker.org") :clock-in t :clock-resume t))))

(setq org-directory "~/.org/")

;; Configure ORG Directory
(defvar org-directory "~/.org/")

;; Configure Folders
(defvar org-gtd-tasks-folder "~/.org/tasks/")
(defvar org-projects-folder "~/.org/tasks/projects/")

;; Configure files
(defvar org-someday-file (file-truename (concat org-gtd-tasks-folder "someday.org")))
(defvar org-inbox-file (file-truename (concat org-gtd-tasks-folder "inbox.org")))
(defvar org-references-file (file-truename (concat org-gtd-tasks-folder "references.org")))
(defvar org-tickler-file (file-truename (concat org-gtd-tasks-folder"tickler.org")))
(defvar org-next-tasks-file (file-truename (concat org-gtd-tasks-folder "next.org")))

(defun zyro/capture-system ()
  "Capture"
  (interactive)
  (let* ((org-capture-templates
         '(("!" "Quick Capture" plain (function zyro/capture-inbox)
            (file "~/.doom.d/templates/capture.org")))))
    (org-capture)))

(defun zyro/capture-inbox ()
  "Function to locate file for capture template"
  (expand-file-name (format "%s" (file-name-nondirectory (car org-inbox-file))) org-gtd-tasks-folder))

(defun zyro/agenda-someday ()
  "Open next tasks in ORGMODE AGENDA"
  (interactive)
  (let ((org-agenda-files (list (car org-someday-file)))
        (org-super-agenda-groups
                     '((:priority "A")
                       (:priority "B")
                       (:todo "PROJ")
                       (:effort> "0:16")
                       (:effort< "0:15"))))
    (org-agenda nil "t")))

(map! :after org
      :map org-mode-map
      :leader
      :prefix ("e" . "Getting Things Done")
      :desc "SOMEDAY" "s" #'zyro/agenda-someday
      :prefix ("eg" . "goto")
      :desc "Someday Items" "s" #'org-find-someday-file)

(defun org-find-someday-file ()
  "Find default INBOX file"
  (interactive)
  (if (f-file-p (format "%s"(car org-someday-file)))
      (find-file (car org-someday-file))
    (error (format "'%s' does not exist, please check and make sure the file exist."))))
