config.el

(after! org (add-to-list 'org-capture-templates
                         '("!" "Capture" entry (file+headline "~/.org/inbox.org" "INBOX")
                           (file "~/.doom.d/templates/capture.org") :immediate-finish t)))

(defun zyro/quick-capture ()
  "Quick capture to inbox from KEY-BINDING"
  (interactive)
  (org-capture nil "!"))

(map! :after org
      :map org-mode-map
      :leader
      :prefix ("e" . "Getting Things Done")
      :desc "New Capture" "!" #'zyro/quick-capture)

(defun zyro/agenda-inbox ()
  "Configure our Inbox agenda"
  (interactive)
  (let ((org-agenda-files (list org-inbox-file))
        (org-super-agenda-groups
         '((:auto-ts t))))
    (org-agenda nil "t")))

(map! :after org
      :map org-mode-map
      :leader
      :prefix ("e" . "Getting Things Done")
      :desc "Check Inbox" "i" #'zyro/agenda-inbox
      :prefix ("eg" . "goto")
      :desc "Inbox" "i" #'org-find-inbox-file)

(defun org-find-inbox-file ()
  "Find default INBOX file"
  (interactive)
  (if (f-file-p (format "%s"(car org-inbox-file)))
      (find-file (car org-inbox-file))
    (error (format "'%s' does not exist, please check and make sure the file exist."))))

(defun jethro/org-process-inbox ()
  "Called in org-agenda-mode, processes all inbox items."
  (interactive)
  (org-agenda-bulk-mark-regexp "inbox:")
  (jethro/bulk-process-entries))

(defvar jethro/org-current-effort "1:00"
  "Current effort for agenda items.")

(defun jethro/my-org-agenda-set-effort (effort)
  "Set the effort property for the current headline."
  (interactive
   (list (read-string (format "Effort [%s]: " jethro/org-current-effort) nil nil jethro/org-current-effort)))
  (setq jethro/org-current-effort effort)
  (org-agenda-check-no-diary)
  (let* ((hdmarker (or (org-get-at-bol 'org-hd-marker)
                       (org-agenda-error)))
         (buffer (marker-buffer hdmarker))
         (pos (marker-position hdmarker))
         (inhibit-read-only t)
         newhead)
    (org-with-remote-undo buffer
      (with-current-buffer buffer
        (widen)
        (goto-char pos)
        (org-show-context 'agenda)
        (funcall-interactively 'org-set-effort nil jethro/org-current-effort)
        (end-of-line 1)
        (setq newhead (org-get-heading)))
      (org-agenda-change-all-lines newhead hdmarker))))

(defun jethro/org-agenda-process-inbox-item ()
  "Process a single item in the org-agenda."
  (org-with-wide-buffer
   (org-agenda-set-tags)
   (org-agenda-set-property)
   (org-agenda-priority)
   (call-interactively 'org-agenda-schedule)
   (call-interactively 'jethro/my-org-agenda-set-effort)
   (org-agenda-refile nil nil t)))

(defun jethro/bulk-process-entries ()
  (if (not (null org-agenda-bulk-marked-entries))
      (let ((entries (reverse org-agenda-bulk-marked-entries))
            (processed 0)
            (skipped 0))
        (dolist (e entries)
          (let ((pos (text-property-any (point-min) (point-max) 'org-hd-marker e)))
            (if (not pos)
                (progn (message "Skipping removed entry at %s" e)
                       (cl-incf skipped))
              (goto-char pos)
              (let (org-loop-over-headlines-in-active-region) (funcall 'jethro/org-agenda-process-inbox-item))
              ;; `post-command-hook' is not run yet.  We make sure any
              ;; pending log note is processed.
              (when (or (memq 'org-add-log-note (default-value 'post-command-hook))
                        (memq 'org-add-log-note post-command-hook))
                (org-add-log-note))
              (cl-incf processed))))
        (org-agenda-redo)
        (unless org-agenda-persistent-marks (org-agenda-bulk-unmark-all))
        (message "Acted on %d entries%s%s"
                 processed
                 (if (= skipped 0)
                     ""
                   (format ", skipped %d (disappeared before their turn)"
                           skipped))
                 (if (not org-agenda-persistent-marks) "" " (kept marked)")))))

(defun jethro/org-inbox-capture ()
  (interactive)
  "Capture a task in agenda mode."
  (org-capture nil "i"))

(defvar org-someday-file "~/.org/someday.org")
(defun zyro/refile-someday ()
  "Refile TASK to SOMEDAY file"
  (interactive)
  (let ((org-refile-targets '((org-someday-file :maxlevel . 3))))
    (org-refile)))
(bind-key "<f5>R" #'zyro/refile-someday)

(defun zyro/agenda-next-tasks ()
  "Open next tasks in ORGMODE AGENDA"
  (interactive)
  (let ((org-agenda-files (list org-next-tasks-file))
        (org-super-agenda-groups
                     '((:priority "A")
                       (:priority "B")
                       (:todo "PROJ")
                       (:effort> "0:16")
                       (:effort< "0:15"))))
    (org-agenda nil "t")))

(map! :after org
      :map org-mode-map
      :leader
      :prefix ("e" . "Getting Things Done")
      :desc "Check Next Tasks" "n" #'zyro/agenda-next-tasks
      :prefix ("eg" . "goto")
      :desc "Next Tasks" "n" #'org-find-next-tasks-file)

(defun org-find-next-tasks-file ()
  "Default next task file"
  (interactive)
  (if (f-file-p (format "%s" (car org-next-tasks-file)))
      (find-file (car org-next-tasks-file))
      (goto-char (point-min))
    (error (format "'%s', does not exist. Please create the file before continuing." org-next-tasks-file))))

(defun zyro/agenda-references ()
  "Open next tasks in ORGMODE AGENDA"
  (interactive)
  (let ((org-agenda-files (list (car org-references-file)))
        (org-super-agenda-groups
                     '((:auto-ts t))))
    (org-agenda nil "s")))

(map! :after org
      :map org-mode-map
      :leader
      :prefix ("e" . "Getting Things Done")
      :desc "Search references" "r" #'zyro/agenda-references)

(defun org-find-references-file ()
  "Find default INBOX file"
  (interactive)
  (if (f-file-p (format "%s"(car org-someday-file)))
      (find-file (car org-someday-file))
    (error (format "'%s' does not exist, please check and make sure the file exist."))))

;(defun zyro/refile-conditions ()
;  "Condition checker when refiling from target"
;  (when t (equal (buffer-file-name) '(or (org-inbox-file) (org-someday-file)))
;        (org-refile-targets)))

(defun zyro/agenda-projects ()
  (interactive)
  (let ((org-agenda-files (list org-projects-folder))
        (org-agenda-custom-commands
         '(("w" "Master List"
            ((agenda ""
                     ((org-agenda-start-day (org-today))
                      (org-agenda-span 3)))
             (todo ""
                   ((org-super-agenda-groups
                     '((:priority "A")
                       (:effort> "0:16")
                       (:priority "B"))))))))))
    (org-agenda nil "w")))

(setq org-tags-column 0)
